Repository: sheilagomes/wp-trad
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: WordPress 5.0.3 Maintenance Release
pt_br: WordPress 5.0.3 – Atualização de manutenção

source: WordPress 5.0.3 is now available!
pt_br: O WordPress 5.0.3 já está disponível!

source: WordPress 5.1 Beta 1 is now available!
pt_br: O WordPress 5.1 Beta 1 já está disponível!

source: WordPress 5.1 Beta 2 is now available!
pt_br: O WordPress 5.1 Beta 2 já está disponível!

source: WordPress 5.1 Beta 3 is now available!
pt_br: O WordPress 5.1 Beta 3 já está disponível!

source: WordPress 5.1 Field Guide
pt_br: Guia do WordPress 5.1 (em inglês)

source: WordPress 5.1 features a new JavaScript build option, following the large reorganisation of code that started in the 5.0 release.
pt_br: O WordPress 5.1 tem uma nova opção para o "build", isto é, a reorganização dos arquivos de desenvolvimento para a versão final, de JavaScript, seguindo a grande reorganização de código que começou na versão 5.0.

source: WordPress 5.1 has many changes aimed at polishing the developer experience.
pt_br: O WordPress 5.1 tem muitas mudanças com foco na melhoria da experiência de desenvolvimento.

source: WordPress 5.1 is slated for release on February 21, and we need your help to get there!
pt_br: O lançamento do WordPress 5.1 está previsto para 21 de fevereiroe precisamos da sua ajuda para que isso aconteça.

source: WordPress 5.1 is slated for release on February 21, and we need your help to get there.
pt_br: O lançamento do WordPress 5.1 está previsto para 21 de fevereiroe precisamos da sua ajuda para que isso aconteça.

source: WordPress 5.1 will be released on Thursday, February 21, but we need your help to get there—if you haven’t tried 5.1 yet, now is the time!
pt_br: O WordPress 5.1 será lançado na quinta-feira, 21 de fevereiro, mas precisamos da sua ajuda para que isso aconteça. Se você ainda não testou a versão 5.1, a hora é essa!

source: WordPress 5.1.1 Security and Maintenance Release
pt_br: WordPress 5.1.1 – Atualização de segurança e manutenção

source: WordPress 5.1.1 is now available!
pt_br: O WordPress 5.1.1 já está disponível!

source: WordPress 5.1.1 was a short-cycle maintenance release.
pt_br: O WordPress 5.1.1 foi uma versão de manutenção com ciclo de lançamento curto.

source: WordPress 5.2 Beta 1 is now available!
pt_br: O WordPress 5.2 Beta 1 já está disponível!

source: WordPress 5.2 is slated for release on April 30, and we need your help to get there.
pt_br: O lançamento do WordPress 5.2 está previsto para 30 de abril e precisamos da sua ajuda para que isso aconteça.

source: WordPress Accessibility
pt_br: Acessibilidade do WordPress

source: WordPress Developer Resources %s
pt_br: Recursos para desenvolvedores WordPress %s

source: WordPress Development Roadmap
pt_br: Roteiro de desenvolvimento WordPress

source: WordPress Domains
pt_br: Domínios do WordPress

source: WordPress Features
pt_br: Recursos do WordPress

source: WordPress Five Point One:
pt_br: WordPress Cinco ponto Um:

source: WordPress Five-One will be here.
pt_br: O WordPress 5.1 estará por aqui.

source: WordPress Logotype
pt_br: Logo do WordPress

source: WordPress Logotype - Alternative
pt_br: Logo WordPress - Alternativo

source: WordPress Logotype - Standard
pt_br: Logo WordPress - Padrão

source: WordPress Logotype - W Mark
pt_br: Logo WordPress - Marca W

source: WordPress Logotype - Word Mark
pt_br: Logo WordPress - Marca Word

source: WordPress Logotypes
pt_br: Logotipos do WordPress

source: WordPress Logotypes - All Versions
pt_br: Logo WordPress - Todas as versões

source: WordPress News %s
pt_br: Blog WordPress %s

source: WordPress Plugin and Theme Security
pt_br: Segurança de temas e plugins do WordPress

source: WordPress Privacy Policy
pt_br: Política de privacidade do WordPress

source: WordPress Security releases %s
pt_br: Atualizações de segurança do WordPress %s

source: WordPress Swag
pt_br: Produtos do WordPress

source: WordPress Testimonials
pt_br: Depoimentos sobre o WordPress

source: WordPress Version
pt_br: Versão do WordPress

source: WordPress download button.
pt_br: Botão de download do WordPress

source: WordPress is Secure
pt_br: O WordPress é seguro

source: WordPress is open source software
pt_br: O WordPress é um programa de código aberto

source: WordPress is open source software you can use to create a beautiful website, blog, or app.
pt_br: O WordPress é um projeto de código aberto que você pode usar para criar sites, blogs ou aplicativos.

source: WordPress itself was not affected, but plugins could be in some situations.
pt_br: O WordPress não foi afetado, mas em algumas situações os plugins podem ser.

source: WordPress itself works with PHP versions as far back as 5.2.4 (we’re currently recommending version 7.3, so this is great backward compatibility!), but we don’t know if your themes or plugins will work.
pt_br: O WordPress funciona com todas as versões PHP desde a 5.2.4 (atualmente recomendamos a versão 7.3m então isso significa uma retrocompatibilidade enorme!), mas não sabemos quais temas e plugins fazem o mesmo.

source: WordPress market share on the rise over the last 8 years.
pt_br: Crescimento da participação do WordPress no mercado nos últimos 8 anos.

source: WordPress now powers over 1/3rd of the top 10 million sites on the web according to W3Techs.
pt_br: O WordPress agora é responsável por mais de um terço dos principais 10 milhões de sites da internet, segundo a W3Techs.

source: WordPress versions 4.9 and earlier are affected by four security issues which could potentially be exploited as part of a multi-vector attack.
pt_br: As versões 4.9 e anteriores do WordPress foram afetadas por quatro problemas de segurança que podem ser explorados como parte de um ataque multivetor.

source: WordPress versions 4.9.4 and earlier are affected by three security issues.
pt_br: As versões 4.9.4 e anteriores foram afetadas por três problemas de segurança:

source: WordPress versions 4.9.6 and earlier are affected by a media issue that could potentially allow a user with certain capabilities to attempt to delete files outside the uploads directory.
pt_br: As versões 4.9.6 e anteriores do WordPress são afetadas por um problema nas mídias que podem permitir que um usuário com certas capacidades tente excluir arquivos fora do diretório de uploads.

source: WordPress versions 5.0 and earlier are affected by the following bugs, which are fixed in version 5.0.1.
pt_br: As versões 5.0 e anteriores do WordPress foram afetadas pelos erros abaixo, que foram corrigidos na versão 5.0.1.

source: WordPress versions 5.1 and earlier are affected by these bugs, which are fixed in version 5.1.1.
pt_br: As versões 5.1 e anteriores do WordPress foram afetadas pelos erros abaixo, que foram corrigidos na versão 5.1.1.

source: WordPress will start showing notices to administrators of sites that run long-outdated versions of PHP, which is the programming language that powers WordPress.
pt_br: O WordPress começará a mostrar avisos para os administradores de sites que executam uma versão ultrapassada do PHP, que é a linguagem de programação por trás do WordPress.

source: WordPress&nbsp;Swag
pt_br: Produtos&nbsp;do&nbsp;WordPress

source: WordPress&nbsp;Users
pt_br: Sites&nbsp;feitos&nbsp;com&nbsp;WordPress

source: WordPress&rsquo; Philosophy
pt_br: Filosofia do WordPress

source: WordPress.org Login
pt_br: Acesso WordPress.org

source: WordPress.org Privacy Policy
pt_br: Política de privacidade do WordPress.org

source: WordPress.org Theme and Plugin Repositories
pt_br: Repositórios de temas e plugins do WordPress.org

source: Work on making Twenty Nineteen ready for prime time continues on its GitHub repository.
pt_br: O esforço para que o Twenty Nineteen esteja pronto na época de lançamento da versão 5.0 continha no repositório do GitHub.

source: Workshops and training materials
pt_br: Oficinas e materiais de treinamento

source: Writing the Pitch for your WordPress Talk
pt_br: Como escrever o resumo para a sua apresentação sobre o WordPress

source: XXE (XML eXternal Entity) processing attacks
pt_br: Ataques no processamento de Entidades externas de XML (XXE, XML eXternal Entity)

source: Yes and no.
pt_br: Sim e não.

source: You are attempting to log out of WordPress.org.
pt_br: Você está tentando sair do WordPress.org.

source: You are now logged out.
pt_br: Agora você está desconectado.

source: You can download WordPress 5.0.2 or visit Dashboard → Updates and click Update Now.
pt_br: Você pode baixar o WordPress 5.0.2 ou ir em Painel → Atualizações e clicar em Atualizar agora.

source: You can download WordPress 5.0.3 or visit Dashboard → Updates on your site and click Update Now.
pt_br: Você pode baixar o WordPress 5.0.3 ou ir em Painel → Atualizações e clicar em Atualizar agora.

source: You can also request that we erase any personal data we hold about you.
pt_br: Também pode solicitar que removamos qualquer dado pessoal que mantemos sobre você.

source: You can browse the full list of changes on Trac.
pt_br: Você pode navegar pela lista completa de alterações no Trac.

source: You can brush up on what you need to know about PHP 7.3 and WordPress by checking out the developer note on the Make WordPress Core blog.
pt_br: Você pode saber mais sobre o PHP 7.3 e o WordPress lendo as notas de desenvolvimento no blog Make WordPress Core.

source: You can create a password at the following URL:
pt_br: Você pode criar uma nova senha no seguinte endereço:

source: You can create flexible, beautiful content without writing a single line of code, or you can dive into the modern programming APIs that the block editor provides.
pt_br: Você pode criar conteúdos flexíveis e bonitos sem escrever uma linha de código ou você pode mergulhar nas modernas APIs de programação que o editor de blocos fornece.

source: You can improve the accessibility of the content you write, now that simple ARIA labels can be saved in posts and pages.
pt_br: Você pode melhorar a acessibilidade do conteúdo que você escreve, agora que rótulos ARIA simples podem ser salvos em posts e páginas.

source: You can now pass a label to get_search_form(), improving accessibility.
pt_br: Agora é possível passar um "label" para get_search_form(), melhorando a acessibilidade.

source: You can read more about Twenty Nineteen in its introduction post, and follow along with development over on the GitHub repository.
pt_br: Você pode saber mais sobre o Twenty Ninetwwn nest post de apresentação e acompanhar seu desenvolvimento através do repositório no GitHub.

source: You can read more about the fixes and changes since Beta 5 in the last update post.
pt_br: Você pode saber mais sobre os ajustes e mudanças desde o Beta 5 no post de atualização mais recente.

source: You can test the WordPress 5.2 Beta two ways:
pt_br: Você pode testar o WordPress 5.2 Beta de duas formas:

source: You can then restore your backup.
pt_br: Você então pode restaurar o seu backup.

source: You can download WordPress 5.1.1 or visit Dashboard → Updates and click Update Now.
pt_br: Você pode baixar o WordPress 5.1.1 ou ir em Painel → Atualizações e clicar em Atualizar agora.

source: You may download your personal data by clicking on the link below.
pt_br: Você pode baixar seus dados pessoais clicando no link abaixo.

source: You may also have installed a WordPress plugin that provides analytics services.
pt_br: Você também pode ter instalado um plugin do WordPress que fornece serviços de análise.

source: You now have all the information you need to update to the latest version of PHP, and you know how to update in the future as well.
pt_br: Você agora tem todas as informações necessárias para atualizar o PHP para a versão mais recente e também sabe como atualizar para versões futuras.

source: You should also note any collection and retention of sensitive personal data, such as data concerning health.
pt_br: Você também deve justificar qualquer coleta e retenção de dados pessoais sensíveis, como dados referentes a saúde.

source: You should do this regularly anyway.
pt_br: Você deveria fazer isso com frequência.

source: You should now have all the information you need to update!
pt_br: Você agora tem todas as informações necessárias para atualizar!

source: Your WordPress site can be faster, and more secure, and you can make this happen!
pt_br: Você pode tornar o seu site WordPress mais rápido e mais seguro!

source: Your testing helps us!
pt_br: Seus testes nos ajudam!

source: Your username is: %s
pt_br: Seu nome de usuário é: %s

source: You’ll have more flexibility with how content is displayed, whether you are building your first site, revamping your blog, or write code for a living.
pt_br: Você terá mais flexibilidade nas formas como o conteúdo é exibido, esteja você construindo o seu primeiro site, atualizando o seu blog ou seja você programador.

source: You’re now ready to update your website’s PHP version!
pt_br: Tudo está pronto para atualizar a versão PHP do seu site!

source: You’ve done due diligence, got backups, and are in the best possible shape to do the update.
pt_br: Você fez tudo certo, criou um backup e está com tudo certo para fazer a atualização.

source: [Are you a person who identifies as a <specific group>?] Have you considered presenting at a WordCamp but thought you didn’t know enough or felt like an imposter?
pt_br: [Você é uma pessoa que se identifica como um <grupo específico>?] Já pensou em se apresentar em um WordCamp, mas achava que não sabia o suficiente ou se sentia um(a) impostor(a)?

source: [If you are presenting this to a specific group, such as people who identify as women, optional sections to add are indicated in [square brackets].]
pt_br: [Se estiver apresentando a um grupo específico, por exemplo, a pessoas que se identificam como mulheres, há seções opcionais para adicionar indicadas entre [colchetes].]

source: [WordPress.org] Your new account
pt_br: [WordPress.org] Sua nova conta

source: bearing multiple betas;
pt_br: lançando vários betas;

source: https://translate.wordpress.org/projects/wp/dev
pt_br: https://translate.wordpress.org/projects/wp/dev/pt-br/default

source: https://wordpress.org/
pt_br: https://br.wordpress.org/

source: https://wordpress.org/download/
pt_br: https://br.wordpress.org/download/

source: https://wordpress.org/gutenberg/
pt_br: https://br.wordpress.org/gutenberg/

source: https://wordpress.org/news/2018/01/wordpress-4-9-2-security-and-maintenance-release/
pt_br: [parcial]https://wordpress.org/news/2018/01/wordpress-4-9-2-security-and-maintenance-release/

source: https://wordpress.org/news/2018/10/wordpress-5-0-beta-1/
pt_br: https://br.wordpress.org/news/2018/10/wordpress-5-0-beta-1/

source: https://wordpress.org/news/2018/10/wordpress-5-0-beta-2/
pt_br: https://br.wordpress.org/news/2018/10/wordpress-5-0-beta-2/

source: https://wordpress.org/news/2018/11/wordpress-5-0-beta-3/
pt_br: https://br.wordpress.org/news/2018/11/wordpress-5-0-beta-3/

source: https://wordpress.org/news/2018/11/wordpress-5-0-beta-4/
pt_br: https://br.wordpress.org/news/2018/11/wordpress-5-0-beta-4/

source: https://wordpress.org/news/2018/11/wordpress-5-0-beta-5/
pt_br: https://br.wordpress.org/news/2018/11/wordpress-5-0-beta-5/

source: https://wordpress.org/news/2018/11/wordpress-5-0-release-candidate/
pt_br: https://br.wordpress.org/news/2018/11/wordpress-5-0-release-candidate/

source: https://wordpress.org/news/2019/02/wordpress-5-1-release-candidate/
pt_br: https://br.wordpress.org/news/2019/02/wordpress-5-1-release-candidate/

source: https://wordpress.org/plugins/classic-editor/
pt_br: https://br.wordpress.org/plugins/classic-editor/

source: https://wordpress.org/plugins/wordpress-beta-tester/
pt_br: https://br.wordpress.org/plugins/wordpress-beta-tester/

source: in the coming weeks.
pt_br: nas próximas semanas.

source: is just two short weeks away.
pt_br: chega daqui a duas semaninhas.

source: is the case.
pt_br: é o caso.

source: isation is a word with
pt_br: isation is a word with (zação é uma palavra com)

source: many syllables.
pt_br: many syllables. (muitas sílabas.)

source: my WordPress site is hosted on, I want to ensure that
pt_br: onde meu site WordPress está hospedado, quero ter certeza de que

source: of PHP, please let me know what steps I need to take
pt_br: do PHP, por favor me forneçam os passos que preciso tomar

source: possible with the latest version of PHP.
pt_br: possível com a versão mais recente do PHP.

source: the original style block.
pt_br: the original style block. (o estilo de bloco original)

source: to update.
pt_br: para atualizar.

source: “The Improved Fatal Error Protection” — Make WordPress Core
pt_br: “A proteção contra erros fatais” — Make WordPress Core

source: “The block editor is coming to the mobile apps” — Make WordPress Mobile
pt_br: “O editor de blocos está vindo para os aplicativos móveis” — Make WordPress Mobile

source: “Try Gutenberg” callout
pt_br: Chamada para o Gutenberg

source: “WordPress 5.1 Field Guide” — Make WordPress Core
pt_br: “Guia do WordPress 5.1” — Make WordPress Core

source: …and more!
pt_br: …e mais!

source: 🙂 When done, check your site is working as expected.
pt_br: 🙂 Ao concluir, verifique se o seu site está funcionando como o esperado.

source: ﻿Download WordPress 4.9.2 or venture over to Dashboard → Updates and click "Update Now." Sites that support automatic background updates are already beginning to update automatically.
pt_br: Baixe o WordPress 4.9.2 ou visite o Painel → Atualizações e simplesmente clique em “Atualizar agora”. Sites com suporte a atualizações automáticas em segundo plano já começaram a se atualizar.
